Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.h
/*! *********************************************************************************
* Copyright (c) 2015, Freescale Semiconductor, Inc.
* Copyright 2016-2017 NXP.
* All rights reserved.
*
* \file
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */

#ifndef FSL_XCVR_H
/* clang-format off */
#define FSL_XCVR_H
/* clang-format on */

/*******************************************************************************
 * The radio define must be before the driver include files
 ******************************************************************************/

/* KW4xZ/KW3xZ/KW2xZ Radio type */
#define RADIO_IS_GEN_2P1  (1)

#include "fsl_device_registers.h"

#include "fsl_xcvr_trim.h"
#if defined(gMWS_UseCoexistence_d)
#if gMWS_UseCoexistence_d
#include "MWS.h"
#endif /* gMWS_UseCoexistence_d */
#else
#define gMWS_UseCoexistence_d 0
#endif /* defined(gMWS_UseCoexistence_d) */

/* Multi-protocol support capability */
#ifndef XCVR_BLE_ENABLED
#define XCVR_BLE_ENABLED 1
#endif

#ifndef XCVR_ANT_ENABLED
#define XCVR_ANT_ENABLED 0
#endif

#ifndef XCVR_GENFSK_ENABLED
#define XCVR_GENFSK_ENABLED 0
#endif

#ifndef XCVR_802_15_4_ENABLED
#define XCVR_802_15_4_ENABLED 0
#endif

#if RADIO_IS_GEN_3P0
#ifndef XCVR_ANA /* only active if the symbol is undefined */
#define XCVR_ANA   ((XCVR_ANALOG_Type *)XCVR_ANALOG_BASE)
#endif
#endif /* RADIO_IS_GEN_3P0 */

#if !RADIO_IS_GEN_3P0 /* for other than GEN 3 radio, default definition of this symbol to disabled */
#ifndef GFSK_250KBPS_TIMING_ADJUST /* Fix for 250KBPS GFSK modes */
#define GFSK_250KBPS_TIMING_ADJUST (0)
#endif /* ifndef GFSK_250KBPS_TIMING_ADJUST */
#endif /* RADIO_IS_GEN_3P0 */

#if (RADIO_IS_GEN_3P0 || RADIO_IS_GEN_2P1)
#ifndef USE_ZERO_FDEV /* make sure the USE_ZERO_FDEV  flag is defined to support XCVR compilation */
#define USE_ZERO_FDEV (0)
#endif /* USE_ZERO_FDEV */
#endif /* RADIO_IS_GEN_3P0 */
/*!
 * @addtogroup xcvr
 * @{
 */

/*! @file*/

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Default RF OSC definition. Allows for compile time clock frequency definition */
#ifdef CLOCK_MAIN

#else
#if RF_OSC_26MHZ == 1
#define CLOCK_MAIN (EXT_CLK_26_MHZ) /* See ext_clock_config_t for this value */
#else
#define CLOCK_MAIN (EXT_CLK_32_MHZ) /* See ext_clock_config_t for this value */
#endif /* RF_OSC_26MHZ == 1 */
#endif /* CLOCK_MAIN */
 

#define FSL_XCVR_DRIVER_VERSION (MAKE_VERSION(0, 1, 0))

#define B0(x)   (((uint32_t)(((uint32_t)(x)) << 0)) & 0xFFU)
#define B1(x)   (((uint32_t)(((uint32_t)(x)) << 8)) & 0xFF00U)
#define B2(x)   (((uint32_t)(((uint32_t)(x)) << 16)) & 0xFF0000U)
#define B3(x)   (((uint32_t)(((uint32_t)(x)) << 24)) & 0xFF000000U)

#define USE_DEFAULT_PRE_REF             (0)
#define TRIM_BBA_DCOC_DAC_AT_INIT       (1)

#if RADIO_IS_GEN_2P0
#define PRESLOW_ENA                     (1)
#endif /* RADIO_IS_GEN_2P0 */
#if RADIO_IS_GEN_2P1
#define PRESLOW_ENA                     (0)
#endif /* RADIO_IS_GEN_2P1 */
#if RADIO_IS_GEN_3P0
#define PRESLOW_ENA                     (1)
#endif /* RADIO_IS_GEN_3P0 */
#define PHY_AGC_PD_SWITCH_IDX           (0x1A)

/* ==========================  GEN3 & GEN 2.1 TSM defines ========================================== */
#if (RADIO_IS_GEN_3P0 || RADIO_IS_GEN_2P1)

/* TSM timings initializations for Gen3 radio */
/* NOTE: These timings are stored in 32MHz or 26MHz "baseline" settings, selected by conditional compile below */
/* The init structures for 32Mhz and 26MHz are made identical to allow the same code in fsl_xcvr.c to apply the */
/* settings for all radio generations. The Gen2 radio init value storage had a different structure so this preserves compatibility */
#if RF_OSC_26MHZ == 1
/* ********** 26MHz settings ********* */
#define TSM_TIMING00init  (0x6d006f00UL) /* (bb_ldo_hf_en) */
#define TSM_TIMING01init  (0x6d006f00UL) /* (bb_ldo_adcdac_en) */
#define TSM_TIMING02init  (0x6d00ffffUL) /* (bb_ldo_bba_en) */
#define TSM_TIMING03init  (0x6d006f00UL) /* (bb_ldo_pd_en) */
#define TSM_TIMING04init  (0x6d006f00UL) /* (bb_ldo_fdbk_en) */
#define TSM_TIMING05init  (0x6d006f00UL) /* (bb_ldo_vcolo_en) */
#define TSM_TIMING06init  (0x6d006f00UL) /* (bb_ldo_vtref_en) */
#define TSM_TIMING07init  (0x05000500UL) /* (bb_ldo_fdbk_bleed_en) */
#define TSM_TIMING08init  (0x03000300UL) /* (bb_ldo_vcolo_bleed_en) */
#define TSM_TIMING09init  (0x03000300UL) /* (bb_ldo_vcolo_fastcharge_en) */
#define TSM_TIMING10init  (0x6d036f03UL) /* (bb_xtal_pll_ref_clk_en) */
#define TSM_TIMING11init  (0xffff6f03UL) /* (bb_xtal_dac_ref_clk_en) */
#define TSM_TIMING12init  (0x6d03ffffUL) /* (rxtx_auxpll_vco_ref_clk_en) */
#define TSM_TIMING13init  (0x18004c00UL) /* (pll_loop_is_open) */
#define TSM_TIMING14init  (0xffffffffUL) /* (sy_pd_cycle_slip_ld_ft_en) */
#define TSM_TIMING15init  (0x6d036f03UL) /* (sy_vco_en) */
#define TSM_TIMING16init  (0x6d20ffffUL) /* (sy_lo_rx_buf_en) */
#define TSM_TIMING17init  (0xffff6f56UL) /* (sy_lo_tx_buf_en) */
#define TSM_TIMING18init  (0x6d056f05UL) /* (sy_divn_en) */
#define TSM_TIMING19init  (0x18034c03UL) /* (sy_pd_filter_charge_en) */
#define TSM_TIMING20init  (0x6d036f03UL) /* (sy_pd_en) */
#define TSM_TIMING21init  (0x6d046f04UL) /* (sy_lo_divn_en) */
#define TSM_TIMING22init  (0x6d04ffffUL) /* (sy_lo_rx_en) */
#define TSM_TIMING23init  (0xffff6f04UL) /* (sy_lo_tx_en) */
#define TSM_TIMING24init  (0x18004c00UL) /* (sy_divn_cal_en) */
#define TSM_TIMING25init  (0x6d21ffffUL) /* (rx_lna_mixer_en) */
#define TSM_TIMING26init  (0xffff6e59UL) /* (tx_pa_en) */
#define TSM_TIMING27init  (0x6d24ffffUL) /* (rx_adc_i_q_en) */
#define TSM_TIMING28init  (0x2524ffffUL) /* (rx_adc_reset_en) */
#define TSM_TIMING29init  (0x6d22ffffUL) /* (rx_bba_i_q_en) */
#define TSM_TIMING30init  (0x6d24ffffUL) /* (rx_bba_pdet_en) */
#define TSM_TIMING31init  (0x6d23ffffUL) /* (rx_bba_tza_dcoc_en) */
#define TSM_TIMING32init  (0x6d21ffffUL) /* (rx_tza_i_q_en) */
#define TSM_TIMING33init  (0x6d24ffffUL) /* (rx_tza_pdet_en) */
#define TSM_TIMING34init  (0x6d076f07UL) /* (pll_dig_en) */
#if RADIO_IS_GEN_3P0
#define TSM_TIMING35init  (0xffff6f60UL) /* (tx_dig_en) */
#else /* RADIO_IS_GEN_3P0 */
#define TSM_TIMING35init  (0xffff6f5CUL) /* (tx_dig_en) */
#endif /* RADIO_IS_GEN_3P0 */
#define TSM_TIMING36init  (0x6d6affffUL) /* (rx_dig_en) */
#define TSM_TIMING37init  (0x6b6affffUL) /* (rx_init) */
#define TSM_TIMING38init  (0x6d0e6f42UL) /* (sigma_delta_en) */
#define TSM_TIMING39init  (0x6d6affffUL) /* (rx_phy_en) */
#define TSM_TIMING40init  (0x6d2affffUL) /* (dcoc_en) */
#define TSM_TIMING41init  (0x2b2affffUL) /* (dcoc_init) */
#define TSM_TIMING42init  (0xffffffffUL) /* (sar_adc_trig_en) */
#define TSM_TIMING43init  (0xffffffffUL) /* (tsm_spare0_en) */
#define TSM_TIMING44init  (0xffffffffUL) /* (tsm_spare1_en) */
#define TSM_TIMING45init  (0xffffffffUL) /* (tsm_spare2_en) */
#define TSM_TIMING46init  (0xffffffffUL) /* (tsm_spare3_en) */
#define TSM_TIMING47init  (0xffffffffUL) /* (gpio0_trig_en) */
#define TSM_TIMING48init  (0xffffffffUL) /* (gpio1_trig_en) */
#define TSM_TIMING49init  (0xffffffffUL) /* (gpio2_trig_en) */
#define TSM_TIMING50init  (0xffffffffUL) /* (gpio3_trig_en) */
#define TSM_TIMING51init  (0x6d03ffffUL) /* (rxtx_auxpll_bias_en) */
#define TSM_TIMING52init  (0x1b06ffffUL) /* (rxtx_auxpll_fcal_en) */
#define TSM_TIMING53init  (0x6d03ffffUL) /* (rxtx_auxpll_lf_pd_en) */
#define TSM_TIMING54init  (0x1b03ffffUL) /* (rxtx_auxpll_pd_lf_filter_charge_en) */
#define TSM_TIMING55init  (0x6d24ffffUL) /* (rxtx_auxpll_adc_buf_en) */
#define TSM_TIMING56init  (0x6d24ffffUL) /* (rxtx_auxpll_dig_buf_en) */
#define TSM_TIMING57init  (0x1a03ffffUL) /* (rxtx_rccal_en) */
#define TSM_TIMING58init  (0xffff6f03UL) /* (tx_hpm_dac_en) */
#define END_OF_SEQinit    (0x6d6c6f68UL) /*  */
#if RADIO_IS_GEN_3P0
#define TX_RX_ON_DELinit  (0x00008a86UL) /*  */
#else /* RADIO_IS_GEN_3P0 */
#define TX_RX_ON_DELinit  (0x0000868aUL) /*  */
#endif /* RADIO_IS_GEN_3P0 */
#define TX_RX_SYNTH_init  (0x00002a18UL) /*  */
#else /* RF_OSC_26MHZ == 1 */
/* ********** 32MHz settings ********* */
#define TSM_TIMING00init  (0x69006f00UL) /* (bb_ldo_hf_en) */
#define TSM_TIMING01init  (0x69006f00UL) /* (bb_ldo_adcdac_en) */
#define TSM_TIMING02init  (0x6900ffffUL) /* (bb_ldo_bba_en) */
#define TSM_TIMING03init  (0x69006f00UL) /* (bb_ldo_pd_en) */
#define TSM_TIMING04init  (0x69006f00UL) /* (bb_ldo_fdbk_en) */
#define TSM_TIMING05init  (0x69006f00UL) /* (bb_ldo_vcolo_en) */
#define TSM_TIMING06init  (0x69006f00UL) /* (bb_ldo_vtref_en) */
#define TSM_TIMING07init  (0x05000500UL) /* (bb_ldo_fdbk_bleed_en) */
#define TSM_TIMING08init  (0x03000300UL) /* (bb_ldo_vcolo_bleed_en) */
#define TSM_TIMING09init  (0x03000300UL) /* (bb_ldo_vcolo_fastcharge_en) */
#define TSM_TIMING10init  (0x69036f03UL) /* (bb_xtal_pll_ref_clk_en) */
#define TSM_TIMING11init  (0xffff6f03UL) /* (bb_xtal_dac_ref_clk_en) */
#define TSM_TIMING12init  (0x6903ffffUL) /* (rxtx_auxpll_vco_ref_clk_en) */
#define TSM_TIMING13init  (0x18004c00UL) /* (pll_loop_is_open) */
#define TSM_TIMING14init  (0xffffffffUL) /* (sy_pd_cycle_slip_ld_ft_en) */
#define TSM_TIMING15init  (0x69036f03UL) /* (sy_vco_en) */
#define TSM_TIMING16init  (0x691cffffUL) /* (sy_lo_rx_buf_en) */
#define TSM_TIMING17init  (0xffff6f55UL) /* (sy_lo_tx_buf_en) */
#define TSM_TIMING18init  (0x69056f05UL) /* (sy_divn_en) */
#define TSM_TIMING19init  (0x18034c03UL) /* (sy_pd_filter_charge_en) */
#define TSM_TIMING20init  (0x69036f03UL) /* (sy_pd_en) */
#define TSM_TIMING21init  (0x69046f04UL) /* (sy_lo_divn_en) */
#define TSM_TIMING22init  (0x6904ffffUL) /* (sy_lo_rx_en) */
#define TSM_TIMING23init  (0xffff6f04UL) /* (sy_lo_tx_en) */
#define TSM_TIMING24init  (0x18004c00UL) /* (sy_divn_cal_en) */
#define TSM_TIMING25init  (0x691dffffUL) /* (rx_lna_mixer_en) */
#define TSM_TIMING26init  (0xffff6e58UL) /* (tx_pa_en) */
#define TSM_TIMING27init  (0x6920ffffUL) /* (rx_adc_i_q_en) */
#define TSM_TIMING28init  (0x2120ffffUL) /* (rx_adc_reset_en) */
#define TSM_TIMING29init  (0x691effffUL) /* (rx_bba_i_q_en) */
#define TSM_TIMING30init  (0x6920ffffUL) /* (rx_bba_pdet_en) */
#define TSM_TIMING31init  (0x691fffffUL) /* (rx_bba_tza_dcoc_en) */
#define TSM_TIMING32init  (0x691dffffUL) /* (rx_tza_i_q_en) */
#define TSM_TIMING33init  (0x6920ffffUL) /* (rx_tza_pdet_en) */
#define TSM_TIMING34init  (0x69076f07UL) /* (pll_dig_en) */
#define TSM_TIMING35init  (0xffff6f5fUL) /* (tx_dig_en) */
#define TSM_TIMING36init  (0x6966ffffUL) /* (rx_dig_en) */
#define TSM_TIMING37init  (0x6766ffffUL) /* (rx_init) */
#define TSM_TIMING38init  (0x690e6f42UL) /* (sigma_delta_en) */
#define TSM_TIMING39init  (0x6966ffffUL) /* (rx_phy_en) */
#define TSM_TIMING40init  (0x6926ffffUL) /* (dcoc_en) */
#define TSM_TIMING41init  (0x2726ffffUL) /* (dcoc_init) */
#define TSM_TIMING42init  (0xffffffffUL) /* (sar_adc_trig_en) */
#define TSM_TIMING43init  (0xffffffffUL) /* (tsm_spare0_en) */
#define TSM_TIMING44init  (0xffffffffUL) /* (tsm_spare1_en) */
#define TSM_TIMING45init  (0xffffffffUL) /* (tsm_spare2_en) */
#define TSM_TIMING46init  (0xffffffffUL) /* (tsm_spare3_en) */
#define TSM_TIMING47init  (0xffffffffUL) /* (gpio0_trig_en) */
#define TSM_TIMING48init  (0xffffffffUL) /* (gpio1_trig_en) */
#define TSM_TIMING49init  (0xffffffffUL) /* (gpio2_trig_en) */
#define TSM_TIMING50init  (0xffffffffUL) /* (gpio3_trig_en) */
#define TSM_TIMING51init  (0x6903ffffUL) /* (rxtx_auxpll_bias_en) */
#define TSM_TIMING52init  (0x1706ffffUL) /* (rxtx_auxpll_fcal_en) */
#define TSM_TIMING53init  (0x6903ffffUL) /* (rxtx_auxpll_lf_pd_en) */
#define TSM_TIMING54init  (0x1703ffffUL) /* (rxtx_auxpll_pd_lf_filter_charge_en) */
#define TSM_TIMING55init  (0x6920ffffUL) /* (rxtx_auxpll_adc_buf_en) */
#define TSM_TIMING56init  (0x6920ffffUL) /* (rxtx_auxpll_dig_buf_en) */
#define TSM_TIMING57init  (0x1a03ffffUL) /* (rxtx_rccal_en) */
#define TSM_TIMING58init  (0xffff6f03UL) /* (tx_hpm_dac_en) */
#define END_OF_SEQinit    (0x69686f67UL) /*  */
#if RADIO_IS_GEN_3P0
#define TX_RX_ON_DELinit  (0x00008286UL) /*  */
#else /* RADIO_IS_GEN_3P0 */
#define TX_RX_ON_DELinit  (0x0000848aUL) /*  */
#endif /* RADIO_IS_GEN_3P0 */
#define TX_RX_SYNTH_init  (0x00002318UL) /*  */
#endif /* RF_OSC_26MHZ == 1 */

#define AUX_PLL_DELAY       (0UL)
/* TSM bitfield shift and value definitions */
#define TX_DIG_EN_ASSERT    (95L) /* Assertion time for TX_DIG_EN, used in mode specific settings */
#define ZGBE_TX_DIG_EN_ASSERT (TX_DIG_EN_ASSERT - 1UL) /* Zigbee TX_DIG_EN must assert 1 tick sooner, see adjustment below based on data padding */
#if RADIO_IS_GEN_2P1
#define TX_DIG_EN_TX_HI_ADJ (0UL)
#endif
/* EDIT THIS LINE TO CONTROL PA_RAMP! */
#define PA_RAMP_TIME        (1) /* Only allowable values are [0, 1, 2, or 4] in Gen3 */
#define PA_RAMP_SEL_0US     (0)
#define PA_RAMP_SEL_1US     (1)
#define PA_RAMP_SEL_2US     (2)
#define PA_RAMP_SEL_4US     (3)
#if !((PA_RAMP_TIME == 0) || (PA_RAMP_TIME == 1) || (PA_RAMP_TIME == 2) || (PA_RAMP_TIME == 4))
#error "Invalid value for PA_RAMP_TIME macro"
#endif /* Error check of PA RAMP TIME */

#define ADD_FOR_26MHZ           (4UL)
#define END_OF_TX_WU_NORAMP     (103UL) /* NOTE: NORAMP and 2us ramp time behaviors are identical for TX WU and WD */
#define END_OF_TX_WD_NORAMP     (111UL) /* NOTE: NORAMP and 2us ramp time behaviors are identical for TX WU and WD */
/* Redefine the values of END_OF_TX_WU and END_OF_TX_WD based on whether DATA PADDING is enabled and the selection of ramp time */
/* These two constants are then used on both common configuration and mode specific configuration files to define the TSM timing values */
#if ((PA_RAMP_TIME == 0) || (PA_RAMP_TIME == 1) || (PA_RAMP_TIME == 2))
    #define END_OF_TX_WU   (END_OF_TX_WU_NORAMP)
    #define END_OF_TX_WD   (END_OF_TX_WD_NORAMP)
    #if (PA_RAMP_TIME == 0)
        #define PA_RAMP_SEL PA_RAMP_SEL_0US
        #define DATA_PADDING_EN (0)
    #else
        #define DATA_PADDING_EN (1)
        #if (PA_RAMP_TIME == 1)
            #define PA_RAMP_SEL PA_RAMP_SEL_1US
        #else
            #define PA_RAMP_SEL PA_RAMP_SEL_2US
        #endif /* (PA_RAMP_TIME == 1) */
    #endif /* (PA_RAMP_TIME == 0) */
#else /* ((PA_RAMP_TIME == 0) || (PA_RAMP_TIME == 1) || (PA_RAMP_TIME == 2)) */
    #if (PA_RAMP_TIME == 4)
        #define END_OF_TX_WU    (END_OF_TX_WU_NORAMP + 2UL)
        #define END_OF_TX_WD    (END_OF_TX_WD_NORAMP + 4UL)
        #define PA_RAMP_SEL PA_RAMP_SEL_4US
        #define DATA_PADDING_EN (1)
    #else /* (PA_RAMP_TIME == 4) */
        #error "Invalid value for PA_RAMP_TIME macro"
    #endif /* (PA_RAMP_TIME == 4) */
#endif/* (PA_RAMP_TIME == 4) */

#define END_OF_RX_WU    (104 + AUX_PLL_DELAY)

#if RF_OSC_26MHZ == 1
#define END_OF_RX_WD    (END_OF_RX_WU + 1 + ADD_FOR_26MHZ) /* Need to handle normal signals extending when 26MHZ warmdown is extended */
#else
#define END_OF_RX_WD    (END_OF_RX_WU + 1)
#endif /* RF_OSC_26MHZ == 1 */

