Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.h
#if (((RADIO_IS_GEN_3P0) || (RADIO_IS_GEN_2P1)) && defined(PA_FEM_SUPPORTED))
/*!
 * @brief Function to initialize support for external PA and FEM module control.
 *
 * This function initializes the PA and FEM control register and timing registers before TX or RX operations using those modules.
 *
 * @param pa_fem_settings_ptr the pointer to a settings structure for PA/FEM initialization.
 * 
 */
xcvrStatus_t XCVR_ExternalFadPaFemInit(xcvr_pa_fem_config_t * pa_fem_settings_ptr);

/*!
 * @brief Function to de-initialize support for external PA and FEM module control.
 *
 * This function resets the PA and FEM control register and timing registers to allow them to be used for other purposes if required.
 *
 */
xcvrStatus_t XCVR_ExternalFadPaFemDeInit(void);

/*!
 * @brief Function to over-ride the antenna selection when FAD is active .
 *
 * This function enables the over-ride of the FAD antenna selection and sets the software requested selection.
 *
 * @param antenna_sel the software antenna selection.
 * 
 */
void XCVR_ExtAntOvrd(XCVR_FAD_OVRD_ANT_A_B_SEL_MODE_T antenna_sel);

/*!
 * @brief Function to release any over-ride the antenna selection and return the antenna to  FAD control .
 *
 * This function enables the over-ride of the FAD antenna selection and sets the software requested selection.
 *
 */
void XCVR_ExtAntRelease(void);

/*!
 * @brief Function to initialize support for external PA and FEM module control using Coexistence pins.
 *
 * This function initializes the PA and FEM control register and timing registers before TX or RX operations using those modules. It
 * sets up to use one or both of the RF_STATUS and RF_PRIORITY pins for PA/FEM control instead of coexistence.
 *
 * @param pa_fem_settings_ptr The pointer to a settings structure for PA/FEM initialization.
 * @param rf_status_func t The function to be applies on the RF_STATUS pin.
 * @param rf_priority_func The function to be applies on the RF_PRIORITY pin.
 * @note
 *  This function is intended to be used when ::XCVR_ExternalFadPaFemInit() cannot be used (if preservation of debugger connection
 *  is required. 
 *  This function does NOT perform any pin muxing settings, that must be performed by a higher layer of software.
 * 
 */
xcvrStatus_t XCVR_FadPaFemOnCoexInit(xcvr_pa_fem_config_t * test_settings, tx_rx_coex_pin_func_t rf_status_func, tx_rx_coex_pin_func_t rf_priority_func);

/*!
 * @brief Function to de-initialize support for external PA and FEM module control over coexistence pins.
 *
 * This function resets the PA and FEM control register and timing registers to allow them to be used for other purposes if required.
 *
 */
void XCVR_FadPaFemOnCoexIDeInit(void);


#endif /* (((RADIO_IS_GEN_3P0) || (RADIO_IS_GEN_2P1)) &&  PA_FEM_SUPPORTED */

#if RADIO_IS_GEN_2P1
/*!
 * @brief Function to set PA power bump to higher power level.
 *
 * This function sets the XCVR LDO registers required to support high power PA operation.
 *
 * @note
 *    The power increase requires DCDC voltage to be increased as well. This is NOT done by the XCVR driver.
 */
void XCVR_bumpPaPowerUp(void);

/*!
 * @brief Function to return PA power bump to the default power level.
 *
 * This function sets the XCVR LDO registers back to the default power level for PA operation.
 *
 * @note
 *    The power level change requires DCDC voltage to be changed as well. This is NOT done by the XCVR driver.
 */
 void XCVR_releasePaPowerBump(void);
#endif /* RADIO_IS_GEN_2P1 */
/* @} */

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* FSL_XCVR_H */
